# Data Preprocessing stage

#### 1. Handling inappropriate data will not come under Data preprocessing , it should be done by Data Enigeer , But Data Scientist will do this.
#### 2. Data Preprocessing stage should be done by Data Analyst, still Data Scientist will do the same.
 3. Data cleaning will be done in two ways
      1. with Pandas
      2. With Scikit learn
### Here we will discuss about pandas to do.

### what is goal or Need of this stage:
 Assuming the fact, the final goal is to create a ML model which can help us perform prediction, this stage is a mandatory stage

#### Certain Expectations/ rules from Stats/DAta Mining Algos/ML Algos/ DL Models
 1. Data must be strictly numeric
 2. Data must be complete

### Preprocessing Task 
 1. Check and Handle Missing Data on all Columns
 2. Check and Handle Categorical Columns
 3. Check and Handle Ordinal Columns
 4. Perform Data Standardization (Optional Component for ML, but Compulsory for DL)

 1. Rules to Handle Missing Data
     Two Perspectives ( Stats Perspective ; Domain Perspective)
     1. Statistical Perspective (Guidelines)
 ============================================================================
     a. Numerical Columns
        Continous Data column: Replace the Missing data with the MEAN value of the column
        Discrete Data column: Replace the Missing data with the MEDIAN value of the column

     b. Non-Numerical Columns:
        Replace The missing data with the Mode Value of the column

     2. Domain Perspective (Guidelines)
 ==========================================================================
     1. Replace the missing data with the default value of that column

     RealEstate ---> Tower ----> BMC /PWD ---> Every Flat Owner must get Car Parking
        1. 2BHK ---> 1 Car Parking
        2. 3BHK.---> 2 Car Parking
        3. 4BHK ---> 3 Car Parking

        Car Parking ----> ?BHK ---> Car Parking
 

         2. Delete that Record
    3. Hybrid Perspective (Guidelines)
    mix the above both wherever requires,partially or fully...

2. Dealing with Categorical Data
     Stats / Domain ---> Create DUMMY VARIABLES
     Refer written notes for example.

3. Dealing with Ordinal Data
Replace Ordinal Values with Relevant Discrete Values !!!

In [1]:
import pandas as pd
import numpy as np

In [2]:
dataDF = pd.read_csv('pre-process_datasample.csv')

In [7]:
dataDF.head

<bound method NDFrame.head of    Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8      NaN  50.0  83000.0        No
9   France  37.0  67000.0       Yes>

In [7]:
dataDF.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Country    9 non-null      object
 1   Age        9 non-null      float64
 2   Salary     9 non-null      float64
 3   Purchased  10 non-null     object
dtypes: float64(2), object(2)
memory usage: 448.0+ bytes

In [ ]:
# the above analysis say, we need to handle the following variables.
# Country
# Age
# Salary
# Purchased

In [8]:
dataDF

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8      NaN  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [9]:
# Deal with Missing Values

In [11]:
#Another way to determine number of NaN in each column
dataDF.isna().sum()

Country      1
Age          1
Salary       1
Purchased    0
dtype: int64

In [10]:
# Above Analysis says we need to handle 
# Stats Perspective
#Country      1 --> Non-numerical ---> Replace NaN with mode
#Age          1 --> Numerical (Discrete) ---> Replace NaN with median
#Salary       1 --> Numerical (Continous)---> Replace NaN with mean

In [14]:
#Country      1 --> Non-numerical ---> Replace NaN with mode
dataDF.Country.mode()

0    France
dtype: object

In [ ]:
# here mode means highest frequency. so frnace is having 4 times in the data which is high in the list
# it will be sorted with the list, then france will be listed as first country aa country, 
# that's y its showing zero

In [16]:
type(dataDF.Country.mode())

pandas.core.series.Series

In [17]:
# the above data is in series, so need to convert to str.
# here [0] given only to check the type of data

In [18]:
dataDF.Country.mode()[0]

'France'

In [19]:
type(dataDF.Country.mode()[0])

str

In [21]:
# this one also gives series of data
dataDF.Country.mode()[:]

0    France
dtype: object

In [22]:
type(dataDF.Country.mode()[:])

pandas.core.series.Series

In [25]:
#Replace NaN with mode
dataDF.Country.fillna( dataDF.Country.mode()[0] , inplace=True )
dataDF

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8   France  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [27]:
#Age          1 --> Numerical (Discrete) ---> Replace NaN with median
dataDF.Age.fillna( dataDF.Age.median() , inplace=True )
dataDF

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain  38.0  52000.0        No
7   France  48.0  79000.0       Yes
8   France  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [32]:
#Salary       1 --> Numerical (Continous)---> Replace NaN with mea
dataDF.Salary.mean()

63777.8

In [28]:
dataDF.Salary.fillna( round( dataDF.Salary.mean() ) , inplace=True )
dataDF

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0  63778.0       Yes
5   France  35.0  58000.0       Yes
6    Spain  38.0  52000.0        No
7   France  48.0  79000.0       Yes
8   France  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [26]:
data[data.Country == 'France']['Salary'].mean()

71800.0

In [27]:
#Dealing with Categorical Data
# Stats / Domain ---> Create DUMMY VARIABLES

In [30]:
finalDataSet = pd.concat([ pd.get_dummies(data.Country) , data.iloc[:,[1,2,3]] ] , axis = 1)

In [31]:
finalDataSet

   France  Germany  Spain   Age   Salary Purchased
0       1        0      0  44.0  72000.0        No
1       0        0      1  27.0  48000.0       Yes
2       0        1      0  30.0  54000.0        No
3       0        0      1  38.0  61000.0        No
4       0        1      0  40.0  63778.0       Yes
5       1        0      0  35.0  58000.0       Yes
6       0        0      1  38.0  52000.0        No
7       1        0      0  48.0  79000.0       Yes
8       1        0      0  50.0  83000.0        No
9       1        0      0  37.0  67000.0       Yes

In [33]:
finalDataSet.Purchased.replace(['No','Yes'],[0,1] , inplace=True)

In [34]:
finalDataSet

   France  Germany  Spain   Age   Salary  Purchased
0       1        0      0  44.0  72000.0          0
1       0        0      1  27.0  48000.0          1
2       0        1      0  30.0  54000.0          0
3       0        0      1  38.0  61000.0          0
4       0        1      0  40.0  63778.0          1
5       1        0      0  35.0  58000.0          1
6       0        0      1  38.0  52000.0          0
7       1        0      0  48.0  79000.0          1
8       1        0      0  50.0  83000.0          0
9       1        0      0  37.0  67000.0          1

In [30]:
dataDF.Country.loc[dataDF.Country == np.nan] = dataDF.Country.mode()
# ALSO CAN BE USED

C:\Users\davea\anaconda3\lib\site-packages\pandas\core\indexing.py:1637: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._setitem_single_block(indexer, value, name)